artillery.yaml
config:
  target: https://jmedia-staging.up.railway.app/api/v1

  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 15
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase

  plugins:
    ensure: { }
    apdex: { }
    metrics-by-endpoint: { }
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75

scenarios:
  - name: Search animes / mangas
    flow:
      - loop:
        - get:
            url: '/search?types=anime,manga&q=oshi no'
        - get:
            url: '/search?types=anime&q=oshi no'
        - get:
            url: '/search?types=manga&q=oshi no'
        count: 100