artillery.yaml
config:
  target: https://jmedia-staging.up.railway.app/api/v1

  phases:
    - duration: 30
      arrivalRate: 5
      rampTo: 30
      name: Default

  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
    ensure:
      maxErrorRate: 1
      thresholds:
        - http.response_time.p99: 500
    apdex:
      threshold: 500

scenarios:
  - name: Search animes / mangas
    flow:
      - loop:
        - get:
            url: '/search?types=anime,manga&q=oshi no'
        - get:
            url: '/search?types=anime&q=oshi no'
        - get:
            url: '/search?types=manga&q=oshi no'
        count: 50